ticketTrain/soap-app/src/test/resources/requests/payment/getAllPaymentWithDirectionRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xs="http://epam.com/brest2019/courses/soap/model/payment">

    <soapenv:Header/>
    <soapenv:Body>
        <xs:getAllWithDirectionRequest>
        </xs:getAllWithDirectionRequest>
    </soapenv:Body>

</soapenv:Envelope>